
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	// { Михалев Д.А. #00001#17.01.2026#
	ПроверкаПройдена = ЗначениеЗаполнено(ПериодЗапроса);
	// } Михалев Д.А. #00001#17.01.2026#

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьЛизинг(Команда)

	// { Михалев Д.А. #00001#17.01.2026#
	ПроверитьЗаполнение();
	
	ПолучитьЛизингНаСервере();
	// } Михалев Д.А. #00001#17.01.2026#

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьЛизингНаСервере()

	// { Михалев Д.А. #00001#17.01.2026#
	Если Не ПроверкаПройдена Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОтбора = Новый Структура("ДатаНачала,ДатаОкончания", 
		ПериодЗапроса.ДатаНачала, 
		ПериодЗапроса.ДатаОкончания);
		
	ОбъектФормы = РеквизитФормыВЗначение("Объект");
	ОбъектФормы.ПолучитьЛизинговыеДвижения(ПараметрыОтбора);
	
	ТекстСообщения = НСтр("ru='Действие завершено.'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	// } Михалев Д.А. #00001#17.01.2026#

КонецПроцедуры

#КонецОбласти



